## Terraform Plan for `infrastructure/global/email`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_sns_topic.ses_bounces: Refreshing state... [id=arn:aws:sns:us-east-1:668144156539:ses-bounces]
aws_route53_record.mx: Refreshing state... [id=Z06509101Z22NMKSMXDLL_servicios-cires.net_MX]
aws_sns_topic.email_replies: Refreshing state... [id=arn:aws:sns:us-east-1:668144156539:email-replies]
aws_sns_topic.ses_complaints: Refreshing state... [id=arn:aws:sns:us-east-1:668144156539:ses-complaints]
module.ses.aws_ses_domain_identity.ses_domain[0]: Refreshing state... [id=servicios-cires.net]
aws_lambda_permission.sns_to_lambda: Refreshing state... [id=terraform-20260204171146960900000001]
aws_ses_receipt_rule_set.default: Refreshing state... [id=default-rule-set]
aws_sns_topic.readable_notifications: Refreshing state... [id=arn:aws:sns:us-east-1:668144156539:ses-readable-notifications]
aws_sns_topic_subscription.lambda_to_raw: Refreshing state... [id=arn:aws:sns:us-east-1:668144156539:ses-bounces:7ae5c795-5d31-439b-b719-f9a28a32bb0d]
aws_iam_role.bounce_processor_role: Refreshing state... [id=ses_bounce_processor_role]
module.ses.aws_ses_domain_dkim.ses_domain_dkim[0]: Refreshing state... [id=servicios-cires.net]
aws_s3_bucket.bounce_processor_source_code: Refreshing state... [id=cires-ses-bouce-processor-code]
module.ses.aws_route53_record.amazonses_verification_record[0]: Refreshing state... [id=Z06509101Z22NMKSMXDLL__amazonses.servicios-cires.net_TXT]
aws_ses_active_receipt_rule_set.active: Refreshing state... [id=default-rule-set]
aws_ses_identity_notification_topic.complaint_topic: Refreshing state... [id=arn:aws:ses:us-east-1:668144156539:identity/servicios-cires.net|Complaint]
aws_ses_receipt_rule.email_forwarding_rule: Refreshing state... [id=forward-incoming-to-sns]
aws_ses_identity_notification_topic.bounce_topic: Refreshing state... [id=arn:aws:ses:us-east-1:668144156539:identity/servicios-cires.net|Bounce]
module.ses.aws_route53_record.amazonses_dkim_record[2]: Refreshing state... [id=Z06509101Z22NMKSMXDLL_2se4znqcj7quk6vvuxogcaoz5nguzbti._domainkey.servicios-cires.net_CNAME]
module.ses.aws_route53_record.amazonses_dkim_record[0]: Refreshing state... [id=Z06509101Z22NMKSMXDLL_clqy32zupqepl55vvvwqadlaxrv3bvnk._domainkey.servicios-cires.net_CNAME]
module.ses.aws_route53_record.amazonses_dkim_record[1]: Refreshing state... [id=Z06509101Z22NMKSMXDLL_rmezm25un2wzzsjtpqroy6y7acjrqbfl._domainkey.servicios-cires.net_CNAME]
aws_iam_role_policy.bounce_processor_policy: Refreshing state... [id=ses_bounce_processor_role:ses_bounce_processor_policy]
aws_lambda_function.bounce_processor: Refreshing state... [id=ses-bounce-processor]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_function.bounce_processor will be updated in-place
  ~ resource "aws_lambda_function" "bounce_processor" {
        id                             = "ses-bounce-processor"
      ~ last_modified                  = "2026-02-06T18:44:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "TyDAHMrbRZyczBjLBgT08xyBa0xUGzZW6atT/gY0GbY=" -> "HCYiDwb4QqjFS0DZLvK9tbGncMPA9FsWwj7iDknniPQ="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_permission.bounces_to_lambda will be created
  + resource "aws_lambda_permission" "bounces_to_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ses-bounce-processor"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:us-east-1:668144156539:ses-bounces"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.complaints_to_lambda will be created
  + resource "aws_lambda_permission" "complaints_to_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ses-bounce-processor"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:us-east-1:668144156539:ses-complaints"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.replies_to_lambda will be created
  + resource "aws_lambda_permission" "replies_to_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ses-bounce-processor"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:us-east-1:668144156539:email-replies"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.sns_to_lambda will be destroyed
  # (because aws_lambda_permission.sns_to_lambda is not in configuration)
  - resource "aws_lambda_permission" "sns_to_lambda" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "ses-bounce-processor" -> null
      - id                  = "terraform-20260204171146960900000001" -> null
      - principal           = "sns.amazonaws.com" -> null
      - source_arn          = "arn:aws:sns:us-east-1:668144156539:ses-bounces" -> null
      - statement_id        = "terraform-20260204171146960900000001" -> null
      - statement_id_prefix = "terraform-" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_sns_topic_subscription.bounces_to_lambda will be created
  + resource "aws_sns_topic_subscription" "bounces_to_lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:us-east-1:668144156539:function:ses-bounce-processor"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:668144156539:ses-bounces"
    }

  # aws_sns_topic_subscription.complaints_to_lambda will be created
  + resource "aws_sns_topic_subscription" "complaints_to_lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:us-east-1:668144156539:function:ses-bounce-processor"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:668144156539:ses-complaints"
    }

  # aws_sns_topic_subscription.lambda_to_raw will be destroyed
  # (because aws_sns_topic_subscription.lambda_to_raw is not in configuration)
  - resource "aws_sns_topic_subscription" "lambda_to_raw" {
      - arn                             = "arn:aws:sns:us-east-1:668144156539:ses-bounces:7ae5c795-5d31-439b-b719-f9a28a32bb0d" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:us-east-1:668144156539:function:ses-bounce-processor" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:668144156539:ses-bounces:7ae5c795-5d31-439b-b719-f9a28a32bb0d" -> null
      - owner_id                        = "668144156539" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:668144156539:ses-bounces" -> null
        # (6 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.replies_to_lambda will be created
  + resource "aws_sns_topic_subscription" "replies_to_lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:us-east-1:668144156539:function:ses-bounce-processor"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:668144156539:email-replies"
    }

Plan: 6 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Daniel-Ibarrola, Action: `pull_request`*